Repository: Goldenmonstew/GlossPop
Catalog: Sources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, zh_hans, zh_hant

source: · analysis failed
de: · Analyse fehlgeschlagen
es: · error de análisis
fr: · échec de l'analyse
ja: · 解析に失敗
ko: · 분석 실패
ru: · ошибка анализа
zh_hans: · 解析失败
zh_hant: · 分析失敗

source: · on-device
de: · auf dem Gerät
es: · en el dispositivo
fr: · sur l'appareil
ja: · オンデバイス
ko: · 온디바이스
ru: · на устройстве
zh_hans: · 本机
zh_hant: · 裝置端

source: %@ + AI dictionary%@
de: %@ + KI-Lexikon%@
es: %@ + diccionario de IA%@
fr: %@ + dictionnaire IA%@
ja: %@ + AI辞書%@
ko: %@ + AI 사전%@
ru: %@ + ИИ-словарь%@
zh_hans: %@ + AI 词典%@
zh_hant: %@ + AI 辭典%@

source: %@ · AI dictionary failed%@ · %@
de: %@ · KI-Lexikon fehlgeschlagen%@ · %@
es: %@ · error del diccionario de IA%@ · %@
fr: %@ · échec du dictionnaire IA%@ · %@
ja: %@ · AI辞書の取得に失敗%@ · %@
ko: %@ · AI 사전 실패%@ · %@
ru: %@ · сбой ИИ-словаря%@ · %@
zh_hans: %@ · AI 词典查询失败%@ · %@
zh_hant: %@ · AI 辭典查詢失敗%@ · %@

source: %@ · AI dictionary: no result%@
de: %@ · KI-Lexikon: kein Ergebnis%@
es: %@ · diccionario de IA: sin resultados%@
fr: %@ · dictionnaire IA : aucun résultat%@
ja: %@ · AI辞書: 結果なし%@
ko: %@ · AI 사전: 결과 없음%@
ru: %@ · ИИ-словарь: нет результата%@
zh_hans: %@ · AI 词典：暂无结果%@
zh_hant: %@ · AI 辭典：無結果%@

source: %@ · AI not configured (pick a model in Settings)
de: %@ · KI nicht konfiguriert (Modell in den Einstellungen wählen)
es: %@ · IA no configurada (elige un modelo en Ajustes)
fr: %@ · IA non configurée (choisissez un modèle dans les Réglages)
ja: %@ · AI未設定（設定でモデルを選択）
ko: %@ · AI 미설정(설정에서 모델 선택)
ru: %@ · ИИ не настроен (выберите модель в Настройках)
zh_hans: %@ · AI 未配置（请在设置中选择模型）
zh_hant: %@ · 尚未設定 AI（請在「設定」中選擇模型）

source: %@ · history
de: %@ · Verlauf
es: %@ · historial
fr: %@ · historique
ja: %@ · 履歴
ko: %@ · 기록
ru: %@ · история
zh_hans: %@ · 历史
zh_hant: %@ · 歷史記錄

source: %@ → %@ · %@ analysing…
de: %@ → %@ · %@ analysiert…
es: %@ → %@ · %@ analizando…
fr: %@ → %@ · %@ analyse…
ja: %@ → %@ · %@ 解析中…
ko: %@ → %@ · %@ 분석 중…
ru: %@ → %@ · %@ анализирует…
zh_hans: %@ → %@ · %@ 解析中…
zh_hant: %@ → %@ · %@ 分析中…

source: %@ → %@ · %@ translating…
de: %@ → %@ · %@ übersetzt…
es: %@ → %@ · %@ traduciendo…
fr: %@ → %@ · %@ traduit…
ja: %@ → %@ · %@ 翻訳中…
ko: %@ → %@ · %@ 번역 중…
ru: %@ → %@ · %@ переводит…
zh_hans: %@ → %@ · %@ 翻译中…
zh_hant: %@ → %@ · %@ 翻譯中…

source: (Empty)
de: (Leer)
es: (Vacío)
fr: (Vide)
ja: （なし）
ko: (비어 있음)
ru: (Пусто)
zh_hans: （空）
zh_hant: （空）

source: AI dictionary failed
de: KI-Lexikon fehlgeschlagen
es: Error del diccionario de IA
fr: Échec du dictionnaire IA
ja: AI辞書の取得に失敗しました
ko: AI 사전 실패
ru: Сбой ИИ-словаря
zh_hans: AI 词典查询失败
zh_hant: AI 辭典查詢失敗

source: AI dictionary only
de: Nur KI-Lexikon
es: Solo diccionario de IA
fr: Dictionnaire IA uniquement
ja: AI辞書のみ
ko: AI 사전만 사용
ru: Только ИИ-словарь
zh_hans: 仅 AI 词典
zh_hant: 僅使用 AI 辭典

source: AI dictionary%@
de: KI-Lexikon%@
es: Diccionario de IA%@
fr: Dictionnaire IA%@
ja: AI辞書%@
ko: AI 사전%@
ru: ИИ-словарь%@
zh_hans: AI 词典%@
zh_hant: AI 辭典%@

source: AI dictionary: no result
de: KI-Lexikon: kein Ergebnis
es: Diccionario de IA: sin resultados
fr: Dictionnaire IA : aucun résultat
ja: AI辞書: 結果なし
ko: AI 사전: 결과 없음
ru: ИИ-словарь: нет результата
zh_hans: AI 词典：暂无结果
zh_hant: AI 辭典：無結果

source: AI not configured — pick a model in Settings
de: KI nicht konfiguriert – wähle ein Modell in den Einstellungen
es: IA no configurada: elige un modelo en Ajustes
fr: IA non configurée — choisissez un modèle dans les Réglages
ja: AIが未設定です — 設定でモデルを選択してください
ko: AI 미설정 — 설정에서 모델을 선택하세요
ru: ИИ не настроен — выберите модель в Настройках
zh_hans: AI 未配置——请在设置中选择模型
zh_hant: 尚未設定 AI——請在「設定」中選擇模型

source: AI: no result
de: KI: kein Ergebnis
es: IA: sin resultados
fr: IA : aucun résultat
ja: AI: 結果なし
ko: AI: 결과 없음
ru: ИИ: нет результата
zh_hans: AI：暂无结果
zh_hant: AI：無結果

source: API key
de: API-Schlüssel
es: Clave de API
fr: Clé API
ja: APIキー
ko: API 키
ru: Ключ API
zh_hans: API 密钥
zh_hant: API 金鑰

source: API path
de: API-Pfad
es: Ruta de la API
fr: Chemin de l'API
ja: APIパス
ko: API 경로
ru: Путь API
zh_hans: API 路径
zh_hant: API 路徑

source: About GlossPop
de: Über GlossPop
es: Acerca de GlossPop
fr: À propos de GlossPop
ja: GlossPopについて
ko: GlossPop에 관하여
ru: О приложении GlossPop
zh_hans: 关于 GlossPop
zh_hant: 關於 GlossPop

source: Advanced — custom prompts
de: Erweitert – eigene Prompts
es: Avanzado: prompts personalizados
fr: Avancé — prompts personnalisés
ja: 詳細 — カスタムプロンプト
ko: 고급 — 사용자 지정 프롬프트
ru: Дополнительно — свои промпты
zh_hans: 高级——自定义提示词
zh_hant: 進階——自訂提示詞

source: Apple on-device model
de: Apple-Modell auf dem Gerät
es: Modelo de Apple en el dispositivo
fr: Modèle Apple sur l'appareil
ja: Appleオンデバイスモデル
ko: Apple 온디바이스 모델
ru: Модель Apple на устройстве
zh_hans: Apple 本机模型
zh_hant: Apple 裝置端模型

source: Approve it in System Settings ▸ General ▸ Login Items
de: Bestätige es unter Systemeinstellungen ▸ Allgemein ▸ Anmeldeobjekte
es: Apruébalo en Ajustes del Sistema ▸ General ▸ Ítems de inicio
fr: Approuvez-le dans Réglages Système ▸ Général ▸ Ouverture
ja: システム設定 ▸ 一般 ▸ ログイン項目で許可してください
ko: 시스템 설정 ▸ 일반 ▸ 로그인 항목에서 승인하세요
ru: Подтвердите в Системных настройках ▸ Основные ▸ Объекты входа
zh_hans: 请在系统设置 ▸ 通用 ▸ 登录项 中批准
zh_hant: 請在「系統設定」▸「一般」▸「登入項目」中核准

source: Available system dictionaries (%lld) — enable/download them in Dictionary.app
de: Verfügbare Systemwörterbücher (%lld) — in der Lexikon-App aktivieren/laden
es: Diccionarios del sistema disponibles (%lld): actívalos o descárgalos en la app Diccionario
fr: Dictionnaires système disponibles (%lld) — activez-les ou téléchargez-les dans Dictionnaire
ja: 利用可能なシステム辞書（%lld） — 有効化/ダウンロードは「辞書」アプリで
ko: 사용 가능한 시스템 사전(%lld개) — 사전 앱에서 활성화/다운로드하세요
ru: Доступные системные словари (%lld) — включите или загрузите их в приложении «Словарь»
zh_hans: 可用系统词典（%lld）——在「词典」App 中启用/下载
zh_hant: 可用的系統辭典（%lld）——請在「辭典」App 中啟用或下載

source: Capture
de: Erfassung
es: Captura
ja: キャプチャ
ko: 캡처
ru: Захват текста
zh_hans: 取词
zh_hant: 擷取

source: Changes apply immediately. Translation sends your selected text to this service; the popup footer shows where it went. Reasoning effort only affects models that support it (e.g. gpt-5.x) — lower is faster.
de: Änderungen gelten sofort. Beim Übersetzen wird dein ausgewählter Text an diesen Dienst gesendet; die Fußzeile des Popups zeigt, wohin er ging. Der Reasoning-Aufwand wirkt nur bei Modellen, die ihn unterstützen (z. B. gpt-5.x) – niedriger ist schneller.
es: Los cambios se aplican al instante. Al traducir, el texto seleccionado se envía a este servicio; el pie de la ventana emergente muestra adónde se envió. El esfuerzo de razonamiento solo afecta a los modelos que lo admiten (p. ej., gpt-5.x): cuanto más bajo, más rápido.
fr: Les modifications s'appliquent immédiatement. La traduction envoie votre texte sélectionné à ce service ; le pied de la fenêtre indique où il est parti. L'effort de raisonnement ne concerne que les modèles qui le prennent en charge (p. ex. gpt-5.x) — plus il est faible, plus c'est rapide.
ja: 変更はすぐに適用されます。翻訳では選択したテキストがこのサービスに送信され、送信先はポップアップのフッターに表示されます。推論の強度は対応モデル（例: gpt-5.x）にのみ影響します — 低いほど高速です。
ko: 변경 사항은 즉시 적용됩니다. 번역 시 선택한 텍스트가 이 서비스로 전송되며, 팝업 하단에 전송된 위치가 표시됩니다. 추론 강도는 이를 지원하는 모델(예: gpt-5.x)에만 적용되며, 낮을수록 빠릅니다.
ru: Изменения применяются сразу. При переводе выделенный текст отправляется этому сервису; в нижней строке всплывающего окна видно, куда он ушёл. Уровень рассуждений влияет только на модели, которые его поддерживают (например, gpt-5.x), — чем ниже, тем быстрее.
zh_hans: 改动立即生效。翻译会把选中文本发送给该服务；浮窗底部会显示发送去向。推理强度仅对支持它的模型生效（如 gpt-5.x）——越低越快。
zh_hant: 更改會立即生效。翻譯時會將你選取的文字傳送至此服務；彈出視窗底部會顯示文字的去向。推理強度僅對支援的模型有效（例如 gpt-5.x）——越低速度越快。

source: Check for Updates…
de: Nach Updates suchen…
es: Buscar actualizaciones…
fr: Rechercher des mises à jour…
ja: アップデートを確認…
ko: 업데이트 확인…
ru: Проверить обновления…
zh_hans: 检查更新…
zh_hant: 檢查更新…

source: China mainland
de: Festlandchina
es: China continental
fr: Chine continentale
ja: 中国本土
ko: 중국 본토
ru: Материковый Китай
zh_hans: 中国大陆
zh_hant: 中國大陸

source: Clear History
de: Verlauf löschen
es: Borrar historial
fr: Effacer l'historique
ja: 履歴を消去
ko: 기록 지우기
ru: Очистить историю
zh_hans: 清除历史记录
zh_hant: 清除歷史記錄

source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

source: Compact popup (hide the source hint line)
de: Kompaktes Popup (Hinweiszeile zur Quelle ausblenden)
es: Ventana emergente compacta (oculta la línea de origen)
fr: Fenêtre contextuelle compacte (masquer la ligne de provenance)
ja: コンパクトポップアップ（出典ヒント行を非表示）
ko: 간결한 팝업(출처 힌트 줄 가리기)
ru: Компактное окно (скрывать строку об источнике)
zh_hans: 简洁浮窗(隐藏底部来源提示行)
zh_hant: 精簡彈出視窗（隱藏來源提示列）

source: Connected ✓ configuration is live
de: Verbunden ✓ Konfiguration ist aktiv
es: Conectado ✓ la configuración está activa
fr: Connecté ✓ la configuration est active
ja: 接続済み ✓ 設定は有効です
ko: 연결됨 ✓ 설정이 적용되었습니다
ru: Подключено ✓ конфигурация активна
zh_hans: 连接成功 ✓ 配置已生效
zh_hant: 已連線 ✓ 設定已生效

source: Connection failed: %@
de: Verbindung fehlgeschlagen: %@
es: Error de conexión: %@
fr: Échec de la connexion : %@
ja: 接続に失敗しました: %@
ko: 연결 실패: %@
ru: Не удалось подключиться: %@
zh_hans: 连接失败：%@
zh_hant: 連線失敗：%@

source: Copy
de: Kopieren
es: Copiar
fr: Copier
ja: コピー
ko: 복사하기
ru: Скопировать
zh_hans: 拷贝
zh_hant: 拷貝

source: Copy fallback for apps that hide their selection
de: Kopier-Fallback für Apps, die ihre Auswahl verbergen
es: Alternativa de copiado para apps que ocultan su selección
fr: Copie de secours pour les apps qui masquent leur sélection
ja: 選択テキストを公開しないアプリ向けのコピーフォールバック
ko: 선택 텍스트를 숨기는 앱을 위한 복사 대체 기능
ru: Резервное копирование для приложений, скрывающих выделение
zh_hans: 对隐藏选区的 App 使用复制兜底
zh_hant: 對隱藏選取內容的 App 使用拷貝後備方案

source: Couldn't fetch models: %@
de: Modelle konnten nicht abgerufen werden: %@
es: No se pudieron obtener los modelos: %@
fr: Impossible de récupérer les modèles : %@
ja: モデルを取得できませんでした: %@
ko: 모델을 가져올 수 없음: %@
ru: Не удалось загрузить список моделей: %@
zh_hans: 获取模型列表失败：%@
zh_hant: 無法取得模型列表：%@

source: Couldn't parse the structured response
de: Strukturierte Antwort konnte nicht ausgewertet werden
es: No se pudo analizar la respuesta estructurada
fr: Impossible d'analyser la réponse structurée
ja: 構造化応答を解析できませんでした
ko: 구조화된 응답을 해석할 수 없음
ru: Не удалось разобрать структурированный ответ
zh_hans: 无法解析结构化响应
zh_hant: 無法解析結構化回應

source: Custom / relay
de: Benutzerdefiniert / Relay
es: Personalizado / relay
fr: Personnalisé / relais
ja: カスタム / リレー
ko: 사용자 지정 / 릴레이
ru: Другой / релей
zh_hans: 自定义 / 中转
zh_hant: 自訂／中繼

source: Custom translation prompts
de: Eigene Übersetzungs-Prompts
es: Prompts de traducción personalizados
fr: Prompts de traduction personnalisés
ja: カスタム翻訳プロンプト
ko: 사용자 지정 번역 프롬프트
ru: Свои промпты перевода
zh_hans: 自定义翻译提示词
zh_hant: 自訂翻譯提示詞

source: Cut
de: Ausschneiden
es: Cortar
fr: Couper
ja: カット
ko: 오려두기
ru: Вырезать
zh_hans: 剪切
zh_hant: 剪下

source: Default
de: Standard
es: Por omisión
fr: Par défaut
ja: デフォルト
ko: 기본
ru: По умолчанию
zh_hans: 默认
zh_hant: 預設

source: Dictionary (words / phrases)
de: Lexikon (Wörter / Phrasen)
es: Diccionario (palabras / frases)
fr: Dictionnaire (mots / expressions)
ja: 辞書（単語 / フレーズ）
ko: 사전(단어/구)
ru: Словарь (слова / фразы)
zh_hans: 词典（单词 / 短语）
zh_hant: 辭典（單字／片語）

source: Dictionary mode
de: Lexikon-Modus
es: Modo del diccionario
fr: Mode du dictionnaire
ja: 辞書モード
ko: 사전 모드
ru: Режим словаря
zh_hans: 词典模式
zh_hant: 辭典模式

source: Edit
de: Bearbeiten
es: Edición
fr: Édition
ja: 編集
ko: 편집
ru: Правка
zh_hans: 编辑
zh_hant: 編輯

source: Empty model response
de: Leere Modellantwort
es: Respuesta del modelo vacía
fr: Réponse du modèle vide
ja: モデルの応答が空です
ko: 모델 응답이 비어 있음
ru: Пустой ответ модели
zh_hans: 模型返回为空
zh_hant: 模型回應為空

source: Empty structured result
de: Leeres strukturiertes Ergebnis
es: Resultado estructurado vacío
fr: Résultat structuré vide
ja: 構造化結果が空です
ko: 구조화된 결과가 비어 있음
ru: Пустой структурированный результат
zh_hans: 结构化结果为空
zh_hant: 結構化結果為空

source: Enable more dictionaries in Dictionary.app, or —
de: Aktiviere weitere Wörterbücher in der Lexikon-App, oder –
es: Activa más diccionarios en la app Diccionario, o —
fr: Activez d'autres dictionnaires dans Dictionnaire, ou —
ja: 「辞書」アプリでさらに辞書を有効にするか、または —
ko: 사전 앱에서 더 많은 사전을 활성화하거나 —
ru: Включите дополнительные словари в приложении «Словарь» или —
zh_hans: 在「词典」App 中启用更多词典，或者——
zh_hant: 可在「辭典」App 中啟用更多辭典，或——

source: Endpoint
de: Endpunkt
fr: Point de terminaison
ja: エンドポイント
ko: 엔드포인트
ru: Адрес сервера
zh_hans: 端点
zh_hant: 端點

source: Explain with AI
de: Mit KI erklären
es: Explicar con IA
fr: Expliquer avec l'IA
ja: AIで説明
ko: AI로 설명
ru: Объяснить с помощью ИИ
zh_hans: 用 AI 解释一次
zh_hant: 用 AI 解釋

source: Fetch model list
de: Modellliste abrufen
es: Obtener lista de modelos
fr: Récupérer la liste des modèles
ja: モデル一覧を取得
ko: 모델 목록 가져오기
ru: Загрузить список моделей
zh_hans: 获取模型列表
zh_hant: 取得模型列表

source: Fetched %lld models
de: %lld Modelle abgerufen
es: Se obtuvieron %lld modelos
fr: %lld modèles récupérés
ja: %lld個のモデルを取得しました
ko: 모델 %lld개를 가져왔습니다
ru: Получено моделей: %lld
zh_hans: 已获取 %lld 个模型
zh_hant: 已取得 %lld 個模型

source: Fetching…
de: Wird abgerufen…
es: Obteniendo…
fr: Récupération…
ja: 取得中…
ko: 가져오는 중…
ru: Загрузка…
zh_hans: 获取中…
zh_hant: 正在取得…

source: First language (native / translation target)
de: Erstsprache (Muttersprache / Übersetzungsziel)
es: Primer idioma (nativo / destino de la traducción)
fr: Première langue (maternelle / cible de traduction)
ja: 第一言語（母語 / 翻訳先）
ko: 제1언어(모국어/번역 대상)
ru: Первый язык (родной / язык перевода)
zh_hans: 第一语言（母语 / 翻译目标）
zh_hant: 第一語言（母語／翻譯目標）

source: First time with this cloud service: clicking “Test connection” confirms sending selected text to %@ (one-time) and enables translation.
de: Bei der ersten Nutzung dieses Cloud-Dienstes: Ein Klick auf „Verbindung testen“ bestätigt einmalig, dass ausgewählter Text an %@ gesendet wird, und aktiviert die Übersetzung.
es: Primera vez con este servicio en la nube: al hacer clic en “Probar conexión” confirmas (una sola vez) el envío del texto seleccionado a %@ y se activa la traducción.
fr: Première utilisation de ce service cloud : cliquer sur « Tester la connexion » confirme l'envoi du texte sélectionné à %@ (une seule fois) et active la traduction.
ja: このクラウドサービスの初回利用時：「接続テスト」をクリックすると、選択テキストを %@ に送信することを確認（初回のみ）し、翻訳が有効になります。
ko: 이 클라우드 서비스를 처음 사용합니다. “연결 테스트”를 클릭하면 선택한 텍스트를 %@(으)로 전송하는 데 동의(1회)하고 번역이 활성화됩니다.
ru: Первое использование этого облачного сервиса: нажатие «Проверить подключение» подтверждает отправку выделенного текста на %@ (однократно) и включает перевод.
zh_hans: 首次使用该云服务：点击「测试连接」即确认将选中文本发送至 %@（仅确认一次），并启用翻译。
zh_hant: 首次使用此雲端服務：按一下「測試連線」即代表同意將選取的文字傳送至 %@（僅需確認一次），並啟用翻譯功能。

source: Foundation Models structured output isn't wired up yet
de: Strukturierte Ausgabe der Foundation Models ist noch nicht angebunden
es: La salida estructurada de Foundation Models aún no está implementada
fr: La sortie structurée de Foundation Models n'est pas encore disponible
ja: Foundation Modelsの構造化出力はまだ対応していません
ko: Foundation Models 구조화 출력은 아직 연결되지 않았습니다
ru: Структурированный вывод Foundation Models пока не подключён
zh_hans: Foundation Models 结构化输出尚未接入
zh_hant: Foundation Models 結構化輸出尚未串接

source: General
de: Allgemein
fr: Général
ja: 一般
ko: 일반
ru: Основные
zh_hans: 通用
zh_hant: 一般

source: GlossPop Settings
de: GlossPop-Einstellungen
es: Ajustes de GlossPop
fr: Réglages GlossPop
ja: GlossPopの設定
ko: GlossPop 설정
ru: Настройки GlossPop
zh_hans: GlossPop 设置
zh_hant: GlossPop 設定

source: GlossPop needs Accessibility permission to read your selection.
de: GlossPop benötigt die Bedienungshilfen-Berechtigung, um deine Auswahl zu lesen.
es: GlossPop necesita el permiso de Accesibilidad para leer tu selección.
fr: GlossPop a besoin de l'autorisation d'accessibilité pour lire votre sélection.
ja: 選択テキストの読み取りには、GlossPopにアクセシビリティの権限が必要です。
ko: GlossPop이 선택한 텍스트를 읽으려면 손쉬운 사용 권한이 필요합니다.
ru: GlossPop нужно разрешение «Универсальный доступ», чтобы читать выделенный текст.
zh_hans: GlossPop 需要辅助功能权限来读取你选中的文本。
zh_hant: GlossPop 需要「輔助使用」權限才能讀取你選取的文字。

source: Hide GlossPop
de: GlossPop ausblenden
es: Ocultar GlossPop
fr: Masquer GlossPop
ja: GlossPopを非表示
ko: GlossPop 가리기
ru: Скрыть GlossPop
zh_hans: 隐藏 GlossPop
zh_hant: 隱藏 GlossPop

source: High (more accurate)
de: Hoch (genauer)
es: Alto (más preciso)
fr: Élevé (plus précis)
ja: 高（高精度）
ko: 높음(더 정확함)
ru: Высокий (точнее)
zh_hans: 高（更准确）
zh_hant: 高（更準確）

source: History is off (Settings ▸ General)
de: Verlauf ist deaktiviert (Einstellungen ▸ Allgemein)
es: El historial está desactivado (Ajustes ▸ General)
fr: Historique désactivé (Réglages ▸ Général)
ja: 履歴はオフです（設定 ▸ 一般）
ko: 기록이 꺼져 있음(설정 ▸ 일반)
ru: История отключена (Настройки ▸ Основные)
zh_hans: 历史记录已关闭（设置 ▸ 通用）
zh_hant: 歷史記錄已關閉（「設定」▸「一般」）

source: Invalid endpoint URL
de: Ungültige Endpunkt-URL
es: URL del endpoint no válida
fr: URL de point de terminaison non valide
ja: エンドポイントURLが無効です
ko: 유효하지 않은 엔드포인트 URL
ru: Неверный URL сервера
zh_hans: 端点 URL 无效
zh_hant: 端點 URL 無效

source: Invalid endpoint URL (needs http(s) and a host)
de: Ungültige Endpunkt-URL (benötigt http(s) und einen Host)
es: URL del endpoint no válida (requiere http(s) y un host)
fr: URL de point de terminaison non valide (http(s) et hôte requis)
ja: エンドポイントURLが無効です（http(s) とホストが必要です）
ko: 유효하지 않은 엔드포인트 URL(http(s)와 호스트 필요)
ru: Неверный URL сервера (нужны http(s) и хост)
zh_hans: 端点 URL 无效（需要 http(s) 和主机名）
zh_hant: 端點 URL 無效（需要 http(s) 與主機名稱）

source: Keep translation history (stored in plain text on this Mac)
de: Übersetzungsverlauf behalten (im Klartext auf diesem Mac gespeichert)
es: Conservar el historial de traducciones (guardado en texto plano en este Mac)
fr: Conserver l'historique des traductions (stocké en texte clair sur ce Mac)
ja: 翻訳履歴を保持（このMacに平文で保存されます）
ko: 번역 기록 유지(이 Mac에 일반 텍스트로 저장)
ru: Сохранять историю переводов (хранится открытым текстом на этом Mac)
zh_hans: 保留翻译历史（以明文存储在这台 Mac 上）
zh_hant: 保留翻譯歷史記錄（以純文字儲存在這部 Mac 上）

source: Keychain write failed
de: Schreiben in den Schlüsselbund fehlgeschlagen
es: No se pudo guardar en el llavero
fr: Échec de l'écriture dans le trousseau
ja: キーチェーンへの書き込みに失敗しました
ko: 키체인 저장 실패
ru: Не удалось записать в Связку ключей
zh_hans: 钥匙串写入失败
zh_hant: 鑰匙圈寫入失敗

source: Languages
de: Sprachen
es: Idiomas
fr: Langues
ja: 言語
ko: 언어
ru: Языки
zh_hans: 语言
zh_hant: 語言

source: Launch at login
de: Bei der Anmeldung öffnen
es: Abrir al iniciar sesión
fr: Ouvrir à l'ouverture de session
ja: ログイン時に起動
ko: 로그인 시 실행
ru: Открывать при входе
zh_hans: 登录时启动
zh_hant: 登入時啟動

source: Loading the AI dictionary…
de: KI-Lexikon wird geladen…
es: Cargando el diccionario de IA…
fr: Chargement du dictionnaire IA…
ja: AI辞書を読み込み中…
ko: AI 사전 불러오는 중…
ru: Загрузка ИИ-словаря…
zh_hans: 正在加载 AI 词典…
zh_hant: 正在載入 AI 辭典…

source: Local
de: Lokal
ja: ローカル
ko: 로컬
ru: Локальные
zh_hans: 本地
zh_hant: 本機

source: Local model — your text never leaves this Mac.
de: Lokales Modell – dein Text verlässt diesen Mac nie.
es: Modelo local: tu texto nunca sale de este Mac.
fr: Modèle local — votre texte ne quitte jamais ce Mac.
ja: ローカルモデル — テキストがこのMacの外に送信されることはありません。
ko: 로컬 모델 — 텍스트가 이 Mac을 벗어나지 않습니다.
ru: Локальная модель — ваш текст не покидает этот Mac.
zh_hans: 本地模型——你的文本不会离开这台 Mac。
zh_hant: 本機模型——你的文字絕不會離開這部 Mac。

source: Low (faster)
de: Niedrig (schneller)
es: Bajo (más rápido)
fr: Faible (plus rapide)
ja: 低（高速）
ko: 낮음(더 빠름)
ru: Низкий (быстрее)
zh_hans: 低（更快）
zh_hant: 低（較快）

source: Manage system dictionaries
de: Systemwörterbücher verwalten
es: Gestionar diccionarios del sistema
fr: Gérer les dictionnaires système
ja: システム辞書を管理
ko: 시스템 사전 관리
ru: Управление системными словарями
zh_hans: 管理系统词典
zh_hant: 管理系統辭典

source: Medium
de: Mittel
es: Medio
fr: Moyen
ja: 中
ko: 중간
ru: Средний
zh_hans: 中
zh_hant: 中

source: Minimise
de: Im Dock ablegen
es: Minimizar
fr: Placer dans le Dock
ja: しまう
ko: 최소화
ru: Убрать в Dock
zh_hans: 最小化
zh_hant: 縮到最小

source: Model
de: Modell
es: Modelo
fr: Modèle
ja: モデル
ko: 모델
ru: Модель
zh_hans: 模型
zh_hant: 模型

source: No data[] in the response (this endpoint may not support /models)
de: Kein data[] in der Antwort (dieser Endpunkt unterstützt /models möglicherweise nicht)
es: No hay data[] en la respuesta (puede que este endpoint no admita /models)
fr: Aucun data[] dans la réponse (ce point de terminaison ne prend peut-être pas en charge /models)
ja: 応答に data[] がありません（このエンドポイントは /models に未対応の可能性があります）
ko: 응답에 data[]가 없음(이 엔드포인트는 /models를 지원하지 않을 수 있음)
ru: В ответе нет data[] (этот сервер может не поддерживать /models)
zh_hans: 响应中没有 data[]（该端点可能不支持 /models）
zh_hant: 回應中沒有 data[]（此端點可能不支援 /models）

source: No text selected.
de: Kein Text ausgewählt.
es: No hay texto seleccionado.
fr: Aucun texte sélectionné.
ja: テキストが選択されていません。
ko: 선택된 텍스트가 없습니다.
ru: Текст не выделен.
zh_hans: 未选中任何文本。
zh_hant: 未選取任何文字。

source: No translation model configured.
de: Kein Übersetzungsmodell konfiguriert.
es: No hay ningún modelo de traducción configurado.
fr: Aucun modèle de traduction configuré.
ja: 翻訳モデルが設定されていません。
ko: 설정된 번역 모델이 없습니다.
ru: Модель перевода не настроена.
zh_hans: 未配置翻译模型。
zh_hant: 尚未設定翻譯模型。

source: Normally the selection is read directly and the clipboard is never touched; for the few apps that block this (e.g. Safari), the selection is copied and your clipboard is restored immediately.
de: Normalerweise wird die Auswahl direkt gelesen und die Zwischenablage nie berührt; bei den wenigen Apps, die das blockieren (z. B. Safari), wird die Auswahl kopiert und deine Zwischenablage sofort wiederhergestellt.
es: Normalmente la selección se lee directamente y el portapapeles no se toca; en las pocas apps que lo bloquean (p. ej., Safari), la selección se copia y tu portapapeles se restaura de inmediato.
fr: Normalement, la sélection est lue directement et le presse-papiers n'est jamais modifié ; pour les rares apps qui l'empêchent (p. ex. Safari), la sélection est copiée puis votre presse-papiers est immédiatement restauré.
ja: 通常は選択テキストを直接読み取り、クリップボードには一切触れません。これをブロックする一部のアプリ（例: Safari）では、選択テキストをコピーし、クリップボードをすぐに復元します。
ko: 일반적으로 선택 텍스트를 직접 읽으며 클립보드는 건드리지 않습니다. 이를 차단하는 일부 앱(예: Safari)에서는 선택 텍스트를 복사한 뒤 클립보드를 즉시 복원합니다.
ru: Обычно выделенный текст читается напрямую, не затрагивая буфер обмена; для немногих приложений, которые это блокируют (например, Safari), текст копируется, а буфер обмена сразу восстанавливается.
zh_hans: 通常直接读取选中文本，完全不触碰剪贴板；少数 App（如 Safari）阻止直接读取时，会复制选区并立即恢复你的剪贴板。
zh_hant: 一般情況下會直接讀取選取內容，完全不會動到剪貼板；少數會阻擋此方式的 App（例如 Safari）則會改為拷貝選取內容，並立即回復你的剪貼板。

source: Not a valid chat completion response (check the endpoint/model)
de: Keine gültige Chat-Completion-Antwort (Endpunkt/Modell prüfen)
es: No es una respuesta de chat completion válida (revisa el endpoint/modelo)
fr: Réponse de complétion de chat non valide (vérifiez le point de terminaison/le modèle)
ja: 有効なチャット補完応答ではありません（エンドポイント/モデルを確認してください）
ko: 유효한 chat completion 응답이 아님(엔드포인트/모델을 확인하세요)
ru: Недопустимый ответ chat completion (проверьте адрес сервера и модель)
zh_hans: 不是有效的 chat completion 响应（请检查端点/模型）
zh_hant: 不是有效的 chat completion 回應（請檢查端點／模型）

source: Offline (macOS system dictionary only)
de: Offline (nur macOS-Systemlexikon)
es: Sin conexión (solo diccionario del sistema de macOS)
fr: Hors ligne (dictionnaire système macOS uniquement)
ja: オフライン（macOSシステム辞書のみ）
ko: 오프라인(macOS 시스템 사전만)
ru: Офлайн (только системный словарь macOS)
zh_hans: 离线（仅 macOS 系统词典）
zh_hant: 離線（僅 macOS 系統辭典）

source: Offline + AI detail (system instant, AI appended)
de: Offline + KI-Details (System sofort, KI ergänzt)
es: Sin conexión + detalle de IA (sistema al instante, IA añadida)
fr: Hors ligne + détail IA (système instantané, IA ajoutée)
ja: オフライン + AI詳細（システムは即時、AIを追記）
ko: 오프라인 + AI 상세(시스템 사전 즉시, AI 결과 추가)
ru: Офлайн + детали от ИИ (системный сразу, ИИ дополняет)
zh_hans: 离线 + AI 详解（系统秒出，AI 追加）
zh_hant: 離線 + AI 詳解（系統即時顯示，AI 補充）
